#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.mongodb_atlas_producer.akeyless_producer_mongo.mongo_producer will be created
  + resource "akeyless_producer_mongo" "mongo_producer" {
      + id                      = (known after apply)
      + mongodb_default_auth_db = "admin"
      + mongodb_roles           = jsonencode(
            [
              + {
                  + databaseName = "sample_analytics"
                  + roleName     = "readWrite"
                },
            ]
        )
      + name                    = "/Azure MongoDB Atlas - Sample Analytics"
      + secure_access_db_name   = (known after apply)
      + secure_access_web       = false
      + target_name             = "/Azure Atlas"
      + user_ttl                = "8h"
    }

  # module.mongodb_atlas_producer.akeyless_role.k8s-access-role will be created
  + resource "akeyless_role" "k8s-access-role" {
      + analytics_access             = "none"
      + assoc_auth_method_with_rules = (known after apply)
      + audit_access                 = "none"
      + id                           = (known after apply)
      + name                         = "/terraform-db/Team1"

      + assoc_auth_method {
          + am_name    = "/OktaSAML"
          + sub_claims = {
              + "groups" = "Team1"
            }
        }
      + assoc_auth_method {
          + am_name    = "/my-k8s-auth-method"
          + sub_claims = {
              + "namespace" = "team1"
            }
        }

      + rules {
          + capability = [
              + "list",
              + "read",
            ]
          + path       = "/Azure MongoDB Atlas - Sample Analytics"
          + rule_type  = "item-rule"
        }
      + rules {
          + capability = [
              + "list",
              + "read",
            ]
          + path       = "/k8s/*"
          + rule_type  = "item-rule"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @devorbitus, Action: `pull_request`, Working Directory: ``, Workflow: `Secrets`*